In [1]:
import psycopg2
import psycopg2.extras
import matplotlib.pyplot as plt
import pandas as pd
import numpy as np
import math
from matplotlib.pyplot import figure
import dataframe_image as dfi

In [2]:
connection = psycopg2.connect(
    database="root",
    user="root",
    password="password",
    host="127.0.0.1",
    port="5440"
)
db = connection.cursor(cursor_factory=psycopg2.extras.RealDictCursor)

In [3]:
def getAll(query):
    db.execute(query)
    return pd.DataFrame(data=db.fetchall())

In [4]:
# top 10 tweetow z najwieksza iloscia komentarzy

sql1 = """
select t.id as "Identyfikator tweeta", t.content as "Tweet"
from tweet t
order by reply_count desc
limit 10;
"""

df1 = getAll(sql1)
dfi.export(df1,"top-10-tweetow-z-najwieksza-iloscia-komentarzy.png")
df1

   Identyfikator tweeta                                              Tweet
0   1282002456063295490  T 3590 -I have tested CoviD positive ..  shift...
1   1332066698858352641  I’m incredibly thankful for so much this year....
2   1351897267666608129                         It’s a new day in America.
3   1252734369564733440  Drop me your #cashapp and I’m gonna help as ma...
4   1352359178355011586  I just filed Articles of Impeachment on Presid...
5   1333344528883920896  🦄 #PLTPinkMonday 🦄 We’re giving away $1000 CAS...
6   1325203148684718086  70 million pissed off republicans and not one ...
7   1352754599590035459  Donald Trump is the first president in modern ...
8   1366846908480815106  I just announced Texas is OPEN 100%. \n\nEVERY...
9   1312590918915108866  Nothing can stop him from working for the Amer...

In [5]:
# top 10 tweetow z najwieksza iloscia komentarzy

sql1 = """
select t.id as "Identyfikator tweeta", t.content as "Tweet"
from tweet t
order by reply_count desc
limit 10;
"""

df1 = getAll(sql1)
dfi.export(df1,"top-10-tweetow-z-najwieksza-iloscia-komentarzy.png")
df1

   Identyfikator tweeta                                              Tweet
0   1282002456063295490  T 3590 -I have tested CoviD positive ..  shift...
1   1332066698858352641  I’m incredibly thankful for so much this year....
2   1351897267666608129                         It’s a new day in America.
3   1252734369564733440  Drop me your #cashapp and I’m gonna help as ma...
4   1352359178355011586  I just filed Articles of Impeachment on Presid...
5   1333344528883920896  🦄 #PLTPinkMonday 🦄 We’re giving away $1000 CAS...
6   1325203148684718086  70 million pissed off republicans and not one ...
7   1352754599590035459  Donald Trump is the first president in modern ...
8   1366846908480815106  I just announced Texas is OPEN 100%. \n\nEVERY...
9   1312590918915108866  Nothing can stop him from working for the Amer...

In [6]:
# top 10 tweetow z najwieksza iloscia retweetow

sql1 = """
select t.id as "Identyfikator tweeta", t.content as "Tweet"
from tweet t
order by retweet_count desc
limit 10;
"""

df1 = getAll(sql1)
dfi.export(df1,"top-10-tweetow-z-najwieksza-iloscia-retweetow.png")
df1

   Identyfikator tweeta                                              Tweet
0   1342491135093207044  I’m going to give 5 people that retweet this t...
1   1265832328598884352            What a headline https://t.co/x8GGKL0VMc
2   1266821069823975430  Congratulations to the Astronauts that left Ea...
3   1245435715036430336  I’m gonna give away $5,000 to 3 random people ...
4   1297194550340067328  I’m going to give 10 random people who retweet...
5   1351897267666608129                         It’s a new day in America.
6   1266156916121706502  It’s not white vs black, it’s everybody vs rac...
7   1239834212565430278                             We. Are. The. Problem.
8   1243427980199641088  I swear we are fighting two pandemics \nCovid ...
9   1240324132723544070  I’m 22 years old and I tested positive for COV...

In [7]:
# top 10 tweetow z najwieksza iloscia cytowan

sql1 = """
select t.id as "Identyfikator tweeta", t.content as "Tweet"
from tweet t
order by quote_count desc
limit 10;
"""

df1 = getAll(sql1)
dfi.export(df1,"top-10-tweetow-z-najwieksza-iloscia-cytowan.png")
df1

   Identyfikator tweeta                                              Tweet
0   1318523009829904384  How will you leave 2020 ! https://t.co/wbp5TEhQnf
1   1302697208735653894          IM CRYINGGGGG😭😭😭😭 https://t.co/hI7HyhySi7
2   1300470306503626753  the first three words u see are gonna define y...
3   1321941986174226432  Just had a great meeting with   besides what h...
4   1347684877634838528  After close review of recent Tweets from the  ...
5   1332805215142047744  This is your fate in 2021, screenshot let’s se...
6   1325936220065640449  Quote tweet this tweet and get 0 likes, 0 RT’s...
7   1244498414970101761  I got catfished: a (really long) thread https:...
8   1299785223111147520  the first three words u see are gonna define y...
9   1352048723895832576  Your rap name is “lil” + the last reason you w...

In [8]:
# top 10 tweetow z najwieksza iloscia polubien

sql1 = """
select t.id as "Identyfikator tweeta", t.content as "Tweet"
from tweet t
order by favorite_count desc
limit 10;

"""

df1 = getAll(sql1)
dfi.export(df1,"top-10-tweetow-z-najwieksza-iloscia-polubien.png")
df1

   Identyfikator tweeta                                              Tweet
0   1351897267666608129                         It’s a new day in America.
1   1266821069823975430  Congratulations to the Astronauts that left Ea...
2   1265832328598884352            What a headline https://t.co/x8GGKL0VMc
3   1331307848647761925                                   America is back.
4   1236029449042198528                      The coronavirus panic is dumb
5   1266156916121706502  It’s not white vs black, it’s everybody vs rac...
6   1325890910635384839  I won't be president until January 20th, but m...
7   1239834212565430278                             We. Are. The. Problem.
8   1239617034901524481  This morning I tested positive for Covid 19. I...
9   1243427980199641088  I swear we are fighting two pandemics \nCovid ...

In [9]:
# top 10 userow którzy otrzymali najwięcej polubień pod swoimi tweetami

sql1 = """
select u.name as "Nazwa użytkownika", t.favorite_count as "Liczba polubień pod tweetami"
from "user" u
         join tweet t on u.id = t.user_id
where t.type = 1
order by t.favorite_count desc
limit 10;

"""

df1 = getAll(sql1)
dfi.export(df1,"top-10-userow-ktorzy-otrzymali-najwiecej-polubien-pod-swoimi-tweetami.png")
df1

  Nazwa użytkownika  Liczba polubień pod tweetami
0         Joe Biden                       4182385
1    Andy Milonakis                       3676365
2        King Myle$                       2806770
3         Joe Biden                       1669532
4         Elon Musk                       1590373
5        RomeAlone2                       1573905
6         Joe Biden                       1474336
7                 S                       1312160
8        Idris Elba                       1268070
9            Sir Mo                       1260116

In [10]:
# top 10 userow którzy otrzymali najwięcej polubień pod swoimi komentarzami

sql1 = """
select u.name as "Nazwa użytkownika", t.favorite_count as "Liczba polubień pod komentarzami"
from "user" u
         join tweet t on u.id = t.user_id
where t.type = 2
order by t.favorite_count desc
limit 10;


"""

df1 = getAll(sql1)
dfi.export(df1,"top-10-userow-ktorzy-otrzymali-najwiecej-polubien-pod-swoimi-komentarzami.png")
df1

      Nazwa użytkownika  Liczba polubień pod komentarzami
0          Taylor Swift                            749924
1             Oh Really                            675613
2          Steve Martin                            418737
3               brielle                            379379
4                 katie                            320768
5         Rex Chapman🏇🏼                            173100
6  Jason Patterson 📚📜🗜🎨                            163677
7        Bakari Sellers                            162278
8   The Lincoln Project                            140412
9          Kaila Colbin                            115340